[
    "As it was used, the method that Ford used to attach it to the wheel was worn and thus the cap flew off into the night on a gravel road",
    "Put it in fine, no problems. Shipping was decent 5 days.",
    "Fit wonderfully on my 36HP Pro-Drive motor.",
    "Good for the price!  So far I have put it up in the back window of my 2010 Camry and after several times using my spit and pushing very hard on the suction cups so that you get a black circle effect from looking at it from the outside of the window, they have stuck and have not come off at all.  Make sure you use spit and apply pressure around the entire suction cup to make a secure seal.  Like I said from outside it should look like an all black circle if you have a nice seal going.  Has been up for around one month and has stayed.  It could have been made a little wider as it doesn't cover the entire back window top to bottom, but does seem to be pretty good coverage side to side.",
    "Fit perfectly on my 2012 Tundra with stock alu rims.",
    "Product fits well and closely matches color of original equipment.....much better quality than the original.",
    "convenient ,fast delivery, and fair price",
    "is good",
    "wonderful.  if you need a locking cap, and we did for our jeep grand cherokee as there was a rash of gas siphoning last winter, this is a good one.  no problems.",
    "Does not work with my Ford Taurus. But there's no description on this item whether it will or will not.",
    "I really loved this little mount; now I like it. It fell a little more often than I hoped (maybe my phone was too heavy? Maybe i didn't connect the magnet exactly?). Either way, it was great when I needed the GPS. It did eventually fall off one night with the phone and disappeared into my car. I found it much later, attached to a magnet in my car door and smashed from my closing the door. So GREAT idea, but the magnet is weird.",
    "Just what I wanted.",
    "Great product and fast service.",
    "Appears to be well made. It does what it's supposed to do.",
    "Product was as described, new and a great look. Only bad thing is that one of the screws was stripped so I couldn't tighten all three.",
    "SO much quieter than other compressors.  VERY quick as well.  You will not regret this purchase.",
    "Great for the price, only Issue was the silencer was a little bent and it rattles when the car is revved. Overall great quality",
    "Nice set of tools for the edc bag...I have used this a few times now since purchase and there seems to be a bit to fit everything in a small compact package",
    "Everything ok",
    "I hope the hooks are strong enough.",
    "Very differcult to set up. Didn't want to warranty until I told them I bought them from amazon. Big Bike Parts I won't be buying anything from them ever again. I installed the FOBO, sensors, downloaded the appl. and they started to work right away. 3 weeks on my Harley and there working great.",
    "For",
    "Wiring was simple, and since mine has the side airbags I had the heaters installed in the seats. Love the look of the controls. It adds about 12w per step for a total of 60W when on the highest setting per seat.",
    "I love these lights!",
    "There great for i have had them on other trucks",
    "Poorly made showing fiber/ thread material (white) on all black surface did not look good.",
    "Very nice, high quality, gloss black Kidney Grill.",
    "Came with everything needed.",
    "This decal is literally dope itself I love it and thanks for the free gift with my purchase",
    "Fit my 2010 Jeep Wrangler perfectly and saved me a ton of money as the dealer was going to charge more than double the cost for the part.",
    "Air Lift builds a quality product and stands behind it. Don't let one whiner make you believe otherwise! I installed this set on my Toyota T100 2wd. It fit perfectly, installed easily and the one issue I did have, AirLift customer service handled swiftly and without question. I look forward to these air springs giving us many miles of worry free towing of our Vintage Canned Ham Trailer, even with the bed of the truck loaded with my Motorcycle and everything but the kitchen sink",
    "Discolors very easily if stretched too hard.",
    "works great",
    "Cool design.",
    "It was nice for a month than got a leak in it and trying to figure out how to warnty it",
    "I recommend this item. Hi, While I haven't had to use it yet.....thank goodness.....I am so thankful to have it in my families and my vehicles. Looks very sturdy and saw a special on the news with the same tool and it worked great! So Glad I Ordered them!",
    "Love it ! great quality easy install",
    "Purchased the gray and black ones a while back was kind of easy to install once you watch the video on YouTube Not such a great fit but great for looks and seat protection Would advise you to cover them with a towel on long hot days and if your be driving for awhile or traveling a distances",
    "Charges fine. Battery clips do not grip tightly after a few uses. I have oiled them etc. but it seems that the spring has just to weak for the job.",
    "needed for the windows. Keeps out people.",
    "Thanks, I got the stickers",
    "Thanks",
    "The only plug wires i buy are NGK . cant beat them and amazon has the best prices on them!. if you have another brand on there now expect to see a power boost and better gas millage",
    "These do not fit a 2008 Nissan Sentra I had to return.",
    "Great product at a great price. And shipped ontime.",
    "Works for maintaining, but causes terrible noises. Does not work to recharge a dead battery, read is not completely accurate, reads as battery good, when battery is not charged enough to start vehicle.",
    "Was as advertised.",
    "Threaded Stem does NOT have a Cap Imbedded in the rubber which stiffens the corrugated part.  Stem threaded part is the only thing holding onto the rubber and will pull out of rubber when tightened onto cycle bracket. Threaded stud is correct size to fit hole in motorcycle bracket, yet Hole through stem is too small to allow all wires with connectors to pass through.",
    "Delivered as expected.",
    "Just what I needed.  With a little help from a youtube DIY video it fixed the problem with out a visit to a mechanic.",
    "Well designed and pumps fast!",
    "Too small for my Mom's caddy windshield, would not stay up under the sun visors.",
    "A little beefier than the shocks removed from this 05 trailblazer, but they fit fine and made it ride a lot better.",
    "These shipped much faster than I thought they would, coming from what looks to be China. Initial quality was good, but not as good as what I would expect for the price. I only gave 3 stars because after a few months the caps in the front got loose and one of them fell out while driving so I then only had three left. I've had this problem before with cheaper caps made with less durable plastic that was subject to warping from the heat of the brakes and subsequent expansion of the steel wheel. This cap set was made out of a better plastic but still wasn't good enough. I think hub caps should be made out of high temp plastic (that's still flexible) or metal so they don't have this problem. I ended up just using the full wheel covers that came with my car new (2015 Honda Fit), even though I hate wheel covers. I painted them so they don't look as cheap.",
    "Exactly what I needed. Seems to hold up well.",
    "Nice and quiet muffler for my '02 Jeep Liberty.  Sure was better sounding than the stupid flowmaster that the previous own installed on it.  I've had other FM mufflers on pickups that sounded great but not this one.  This Walker muffler fit nicely, was quiet -- Amazon recommended buying exhaust springs and bolts with this that I didn't need and ended up returning.  This muffler has it's own bolts but you will have to supply your own nuts....  I had a set and used those.  Still waiting on the exhaust pipe to show up but even with just the muffler, it's much quieter.",
    "Excellent Thank You..",
    "Great product",
    "Product arrived quickly. Didn't end up using so I returned them.",
    "Looks great and works much better than the the cheaper ones. Also the is no moisture issues",
    "a great product to stabilize your trailer, and eliminate the rocking motion.",
    "Love these dusters, this had an added bonus of smaller duster for interior of vehicle. Second one I have owned. Read how to care for them and they will last a decade.",
    "Great",
    "This item does not fit the 2004 coupe model. At all. Not sure why someone wrote that it doors. I'm returning this.",
    "great one i like it",
    "received mats very quickly and they met my expectations",
    "Put this on our ATV makes riding with my husband more comfortable. Wish I had got the sooner. Takes a little time to assemble.",
    "works great!!!  highly recommend it.  great value.",
    "I have been using this for about a month now and love it. It makes it easy to keep track of my phone, and if I do need to glance at my phone it helps keep my eyes UP and more on the road.  Everyone who rides with me is always impressed and asked how it works.  Makes it easy to follow GPS and connect my car charger and my AUX cable.  I'm currently using the sticker on my phone, and kept the square piece to use between my case and phone for my next upgrade.  Great buy, great price!",
    "Wow, after reading the negative reviews there is concurrence on: -Bolts are MUCH shorter than OEM and not long enough to engage -Springs are not ground on the ends, longer and difficult to compress. -Threaded portion is smaller diam. than OEM (Yikes!) so the original weld nuts are not reused. -Highly susceptible to corrosion. I think I may opt for some new M8 x 70 hex bolts with flat washers, thread through the original weldnuts and then add new M8 hex nuts.  All stainless if I can find, but regular cadmium plated steel should be better than these.",
    "Very useful",
    "I have a 2004 klr 650 with a pelacin case on the bike and the cover fit great.",
    "Great product. Thank you.",
    "Perfect match.  My car looks almost new.  I just had to pop off the plastic surround and pop them on my car.  It took about 2 seconds.",
    "Such a happy addition to my ride!",
    "Love the wood bead seat cover",
    "Love these stickers, I put them on my kayak and they look awesome.  I've used my kayak several times since putting them on and they are still looking good.",
    "Parts where not correctly made. Took some modification to fit. Would not purchase again.",
    "Exactly what i needed. Thanks!",
    "Such a funny thing. But this product is great!  I am always dropping cel phone, credit cards and all kids of things down the crack.. No more! It blends in so you don't even notice it!",
    "Hands Down, These are the Best Grips out there and I have tried them all. My 3 Sons only use these Grips. Comfortable, Grip is perfect and they look awesome on any bike and a lot of color choices, Believe me. Get them !!",
    "Very nice. Easy to installer.",
    "Wrong part the key only.",
    "I really like this deck brush. The soft bristles are great for the hull, while the stiff bristles get the blood, guts and bait off the deck. Should work great on my RV as well.",
    "Great product fit exactly right",
    "great",
    "Floormats are great and looks good in my car.",
    "This a great product , I wouldnt expect any thing less from k&n !! I am a firm believer in u get what u pay for and k&n is the best !!!.....theres better throttle response and better gas mileage ......all my vehicle get K&n , not junk knock offs 👍",
    "Outstanding look nice.",
    "Easy install.  Seem to be working great so far.  Installed in jeep wrangler tj",
    "I bought this one by mistake, but it looks like good quality.",
    "replace my with not problem",
    "Good quality",
    "I am actually using this for myself on the drivers side window as my commute is long and the PM sun shines in perfect alignment of my face and arm.  The heat is minimally reduced but it blocks the rays off my face.  My prime objective.  The annoying part about this, when you remove it from the window, the suction cups fall off too causing me to dig them out from wherever they fall.  (floor, under the seat, in between the seats)",
    "Item was exactly what I needed. This made washing car parts much easier.",
    "Fit exactly as advertised.  Well engineered for personal installation.  It would have only taken me 10 minutes to install on a hoist, but took me an hour on my back in the driveway.",
    "great stuff .Did the bottom of my rockers 90 sub.Layed it on thick 40psi..........EXELENT",
    "Useless",
    "Came without one part threaded. Company offered to replace or discount. We wanted it now, so we bought a tool and dye kit to thread it ourselves. Otherwise it's a really handsome solid product.",
    "they fit my camper very well( twice cheaper than Camper world..)"
]